* LINE COMMENT: identification header
 IDENTIFICATION DIVISION.
* LINE COMMENT: program id
 PROGRAM-ID. SAMPLE.
 PROCEDURE DIVISION.
*> FREE FORMAT COMMENT: inline
     DISPLAY 'HELLO'. *> end-of-line comment
     STOP RUN.
