 PROCEDURE DIVISION.
     DISPLAY "HELLO, WORLD!".
     DISPLAY 'SINGLE QUOTED'.
     DISPLAY "EMPTY NEXT".
     DISPLAY "".
     DISPLAY 'IT''S FINE'.
     STOP RUN.
