       IDENTIFICATION DIVISION.
       PROGRAM-ID. INVALID-TEST.
       
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY UNDEFINED-VAR.
           STOP RUN.
