       IDENTIFICATION DIVISION.
       PROGRAM-ID. FILEPROC.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CUST-FILE ASSIGN TO CUSTIN.
       DATA DIVISION.
       FILE SECTION.
       FD CUST-FILE.
       01 CUST-REC PIC X(80).
       WORKING-STORAGE SECTION.
       01 WS-EOF   PIC X VALUE 'N'.
       01 WS-COUNT PIC 9(5) VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PARA.
           OPEN INPUT CUST-FILE.
           PERFORM READ-PARA UNTIL WS-EOF = 'Y'.
           CLOSE CUST-FILE.
           DISPLAY WS-COUNT.
           STOP RUN.
       READ-PARA.
           READ CUST-FILE AT END MOVE 'Y' TO WS-EOF.
           ADD 1 TO WS-COUNT.
