       IDENTIFICATION DIVISION.
       PROGRAM-ID. INCOMPLETE.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY 'RUNNING'.
           MOVE 1 TO WS-X.
           STOP RUN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-X PIC 9(3) VALUE 0.
       01 WS-Y PIC 9(3) VALUE 0.
       01 WS-Z PIC X(20) VALUE SPACE.
