       IDENTIFICATION DIVISION.
       PROGRAM-ID. BROKEN.
       PROCEDURE DIVISION.
       MAIN-PARA
           MOVE MOVE TO TO
           IF IF THEN
           PERFORM
           DISPLAY
           STOP RUN
