       IDENTIFICATION DIVISION.
       PROGRAM-ID. SIMPLEPROC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-COUNT   PIC 9(3) VALUE 0.
       01 WS-MESSAGE PIC X(20) VALUE SPACE.
       PROCEDURE DIVISION.
       MAIN-PARA.
           PERFORM INIT-PARA.
           PERFORM REPORT-PARA.
           STOP RUN.
       INIT-PARA.
           MOVE 0 TO WS-COUNT.
           MOVE 'STARTED' TO WS-MESSAGE.
       REPORT-PARA.
           ADD 1 TO WS-COUNT.
           DISPLAY WS-MESSAGE.
           DISPLAY WS-COUNT.
