       IDENTIFICATION DIVISION.
       PROGRAM-ID. TRIVIAL.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY 'HELLO'.
           STOP RUN.
