       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARITHMETIC-TEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUM-A PIC 9(4) VALUE 10.
       01 NUM-B PIC 9(4) VALUE 5.
       PROCEDURE DIVISION.
       MAIN-PARA.
           ADD NUM-A TO NUM-B.
           SUBTRACT 2 FROM NUM-B.
           MULTIPLY NUM-A BY NUM-B.
           DIVIDE 3 INTO NUM-B.
           STOP RUN.
