       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALL-TEST.
       PROCEDURE DIVISION.
       MAIN-PARA.
           CALL "SUBPROG".
           STOP RUN.
