       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOVE-DISPLAY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MSG PIC X(20).
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE "TESTING" TO MSG.
           DISPLAY MSG.
           STOP RUN.
