       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORM-TEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 CNT PIC 9(2) VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PARA.
           PERFORM SUB-PARA.
           STOP RUN.
       SUB-PARA.
           DISPLAY CNT.
