       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALL-TEST.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-ID PIC 9(4) VALUE 1001.
       
       PROCEDURE DIVISION.
       MAIN-PARAGRAPH.
           CALL "CALCULATE-TOTAL".
           CALL "PROCESS-ID" USING WS-ID.
           STOP RUN.
