       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       
       PROCEDURE DIVISION.
       MAIN-PARAGRAPH.
           DISPLAY "HELLO WORLD".
           STOP RUN.
