       IDENTIFICATION DIVISION.
       PROGRAM-ID. UNDEFINED-VAR.
       
       PROCEDURE DIVISION.
       MAIN-PARAGRAPH.
           MOVE 5 TO WS-UNDEFINED.
           DISPLAY WS-UNDEFINED.
           STOP RUN.
