       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEMPCONV.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CELSIUS     PIC 9(3) VALUE 25.
       01 WS-FAHRENHEIT  PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE WS-CELSIUS TO WS-FAHRENHEIT.
           MULTIPLY 9 BY WS-FAHRENHEIT.
           DIVIDE 5 INTO WS-FAHRENHEIT.
           ADD 32 TO WS-FAHRENHEIT.
           DISPLAY WS-FAHRENHEIT.
           STOP RUN.
